import pandas as pd
import numpy as np

import pandas as pd

data = {
    'Категория': ['Электроника', 'Одежда', 'Электроника', 'Дом', 'Одежда', 'Электроника', 'Дом'],
    'Товар': ['Смартфон', 'Футболка', 'Ноутбук', 'Лампа', 'Джинсы', 'Наушники', 'Стул'],
    'Цена': [50000, 1500, 80000, 1200, 3500, 15000, 4500],
    'Количество': [1, 3, 1, 2, 1, 2, 4]
}

df = pd.DataFrame(data)

df['Выручка'] = df['Цена']*df['Количество']
res = df.groupby('Категория').agg({
    'Выручка': 'sum',
    'Цена': 'mean',
    'Количество': 'sum'
})
res = res.sort_values(by='Выручка', ascending=False)
print(res)